## PANDAS 에서 제공하는 대표적인 자료구조

+ Serise

+ DataFrame

+ https://pandas.pydata.org

In [4]:
import pandas as pd
import numpy as np

# #자료 구조는 --> 데이터 틀

### 1. Serise

+ 값과 index를 하나로 합친 구조

In [5]:
s = pd.Series([9904312,3448737,2890451,2466052]) # 시리즈로 바꾸기 
print(s) # 배열인데 인덱스를 붙인것. 배열의 인덱스도 있지만 시리즈에 인덱스는 명시적으로 표현이 되고, 더 다양한 것을 할 수 있음.
print(type(s))
# 자료형에 인덱스를 붙여 주는 함수 enumerate

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
for i in enumerate([9904312,3448737,2890451,2466052]):
    print(i)

print(type(i))

(0, 9904312)
(1, 3448737)
(2, 2890451)
(3, 2466052)
<class 'tuple'>

In [36]:
# 인덱스를 명시적으로 붙여주면 뭐가 좋을까??

##### 인덱스를 자유롭게 지정 가능 
s = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','천안']) #이름을 바꾸거나, 다른 모양으로 쓰일 수 있음.
print(s)                                            # 이걸 인덱스로 쓸 수 있음. 

print('--------------------------------------------------------')
# value와 index를 따로 구하기 
print(s.values,type(s.values)) # , 가 없음 -> 배열
print(s.index)

print('--------------------------------------------------------')
# 인덱스에 이름 지정
s.index.name='도시'
print(s)

print('--------------------------------------------------------')

# Serise 전체의 이름 지정
s.name = '인구'
print(s)

서울    9904312
부산    3448737
인천    2890451
천안    2466052
dtype: int64
--------------------------------------------------------
[9904312 3448737 2890451 2466052] <class 'numpy.ndarray'>
Index(['서울', '부산', '인천', '천안'], dtype='object')
--------------------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
천안    2466052
dtype: int64
--------------------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
천안    2466052
Name: 인구, dtype: int64

In [17]:
##### 백터화 연산 -> 시리즈 자체가 np 배열이기 때문에 벡터화 연산이 가능하다.

s1=s/1000000
print(s1)

도시
서울    9.904312
부산    3.448737
인천    2.890451
천안    2.466052
Name: 인구, dtype: float64

In [35]:
##### 인덱싱

print(s[1])
print(s[1],s['부산']) # --> 바꾼 인덱스 명으로도 가져올 수 있다. 
print(s[1],s['서울'])

print('--------------------------------------------------------')

print(s[1:3]) # 범위 지정 가능
print(s['부산':'천안'])

print('--------------------------------------------------------')

print(s[[0,3,1]]) # 필요한 것만 가져올 수 있음.
print(s[['서울','천안','부산']]) # 보다 직관적

print('--------------------------------------------------------')

 # fancy index 가능 

print(s[(s>250e4) & (s<500e4)])
print('--------------------------------------------------------')

print(s.부산,',',s.서울) # 이 인덱스의 데이터(값이 나옴)

3448737
3448737 3448737
3448737 9904312
--------------------------------------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
천안    2466052
Name: 인구, dtype: int64
--------------------------------------------------------
도시
서울    9904312
천안    2466052
부산    3448737
Name: 인구, dtype: int64
도시
서울    9904312
천안    2466052
부산    3448737
Name: 인구, dtype: int64
--------------------------------------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
3448737 , 9904312

In [56]:
##### Serise와 dict

print('서울' in s)
print('대전' in s) # 없는 인덱스 입력시 false가 나옴.

print('--------------------------------------------------------')
# 딕셔너리 문법과 비슷 

print(list(s.items()))

print('--------------------------------------------------------')
#딕셔너리 처럼도 사용할 수 있음.
s2=pd.Series({'서울':9631482,'부산':3448737,'인천':2632035,'대전':1490158})
print(s2)

True
False
--------------------------------------------------------
[('서울', 9904312), ('부산', 3448737), ('인천', 2890451), ('천안', 2466052)]
--------------------------------------------------------
서울    9631482
부산    3448737
인천    2632035
대전    1490158
dtype: int64

In [57]:
##### 인덱스 기반 연산 
print(s)

print('--------------------------------------------------------')  

print(s2)

print('--------------------------------------------------------')  
result = s-s2  # 인덱스씨리 연산 매칭 되는 것끼리만 없으면 nan값으로 표현 
print(result)


print('--------------------------------------------------------')  

# 값으로만 계산 
print(s.values - s1.values)

도시
서울    9904312
부산    3448737
인천    2890451
천안    2466052
Name: 인구, dtype: int64
--------------------------------------------------------
서울    9631482
부산    3448737
인천    2632035
대전    1490158
dtype: int64
--------------------------------------------------------
대전         NaN
부산         0.0
서울    272830.0
인천    258416.0
천안         NaN
dtype: float64
--------------------------------------------------------
[9904302.095688 3448733.551263 2890448.109549 2466049.533948]

In [65]:
##### 결측치 제거 

print(result)
print(result.notnull())
print(result[result.notnull()])

print('--------------------------------------------------------') 

# s와 s2 데이터를 이용해서 인구 증가율 : (끝 연도 - 시작연도)/시작연도 *100
result2 = (s2-s)/ s*100
print(result2)

result2 = result2[result2.notnull()]
print(result2)

대전         NaN
부산         0.0
서울    272830.0
인천    258416.0
천안         NaN
dtype: float64
대전    False
부산     True
서울     True
인천     True
천안    False
dtype: bool
부산         0.0
서울    272830.0
인천    258416.0
dtype: float64
--------------------------------------------------------
대전         NaN
부산    0.000000
서울   -2.754659
인천   -8.940335
천안         NaN
dtype: float64
부산    0.000000
서울   -2.754659
인천   -8.940335
dtype: float64

In [70]:
#### 데이터의 수정, 삭제, 갱신

result2['부산']= 1.63 # 수정
print(result2)

# 갱신 - 추가
result2['대구'] = 1.41
print(result2)

# 삭제
del result2['서울']
print(result2)

부산    1.630000
서울   -2.754659
인천   -8.940335
대구    1.410000
dtype: float64
부산    1.630000
서울   -2.754659
인천   -8.940335
대구    1.410000
dtype: float64
부산    1.630000
인천   -8.940335
대구    1.410000
dtype: float64

## 2. DataFrame

+ 여러개의 Series를 묶어놓은 형태

In [25]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [26]:
print (data)
print(type(data))

{'2015': [9904312, 3448737, 2890451, 2466052], '2010': [9631482, 3393191, 2632035, 2431774], '2005': [9762546, 3512547, 2517680, 2456016], '2000': [9853972, 3655437, 2466338, 2473990], '지역': ['수도권', '경상권', '수도권', '경상권'], '2010-2015 증가율': [0.0283, 0.0163, 0.0982, 0.0141]}
<class 'dict'>

In [27]:
df=pd.DataFrame(data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

#### (1) 컬럼의 순서(위치) 바꾸기

In [28]:
# ?pd.DataFrame
cols=['지역','2000','2005','2010','2015','2010-2015 증가율'] # 미리 리스트를 만들고

df= pd.DataFrame(data,columns=cols)
print(df)
df#-> 이게 더 이쁨(데이터 프레임 출력할때 쓸 것)

    지역     2000     2005     2010     2015  2010-2015 증가율
0  수도권  9853972  9762546  9631482  9904312         0.0283
1  경상권  3655437  3512547  3393191  3448737         0.0163
2  수도권  2466338  2517680  2632035  2890451         0.0982
3  경상권  2473990  2456016  2431774  2466052         0.0141

    지역     2000     2005     2010     2015  2010-2015 증가율
0  수도권  9853972  9762546  9631482  9904312         0.0283
1  경상권  3655437  3512547  3393191  3448737         0.0163
2  수도권  2466338  2517680  2632035  2890451         0.0982
3  경상권  2473990  2456016  2431774  2466052         0.0141

#### (2) 인덱스 변경

In [29]:
#시리즈에서도 되는 것이니까 여기서도 됨. 
idx=['서울','부산','인천','대구']

df=pd.DataFrame(data,columns=cols,index=idx)
df

     지역     2000     2005     2010     2015  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141

In [30]:
print(df.values)
print(df.columns)
print(df.index)

[['수도권' 9853972 9762546 9631482 9904312 0.0283]
 ['경상권' 3655437 3512547 3393191 3448737 0.0163]
 ['수도권' 2466338 2517680 2632035 2890451 0.0982]
 ['경상권' 2473990 2456016 2431774 2466052 0.0141]]
Index(['지역', '2000', '2005', '2010', '2015', '2010-2015 증가율'], dtype='object')
Index(['서울', '부산', '인천', '대구'], dtype='object')

In [31]:
##### 컬럼과 인덱스에 이름 지정

df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141

In [87]:
#### 전치 가능 데이터 프레임을 시리즈로
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2000           9853972  3655437  2466338  2473990
2005           9762546  3512547  2517680  2456016
2010           9631482  3393191  2632035  2431774
2015           9904312  3448737  2890451  2466052
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### (3) 인덱싱

In [89]:
##### 열 인덱싱
print(df)
print('----------------------------------------------------------------------')

특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141
----------------------------------------------------------------------

In [96]:
print(df['지역'])
print(type(df['지역'])) # --> 열을 하나 뽑으면 시리즈로 바뀜 
# 그럼 변경하고 다시 데이터 프레임으로 저장을 해야함. 

print('----------------------------------------------------------------------')

#pd.DataFrame() 요론식으로 다시 변경이 가능함 
#그러나 더 간단하게 
print(df[['지역']])
print(type(df[['지역']])) # --> 한번 더 묶어 주면 데이터프레임으로 뽑을 수가 있음. 

print('----------------------------------------------------------------------')

print(df[['2015','2010']]) # 두개 이상이면 무조건 [[]] 두번 묶어 줘야함. 

# df[0] 열의 이름이 지정 되어 있으면 숫자로 가져올 수 없음
#df[['2015':'2010']] 열인덱스에서는 범위로 접근이 안됨.
# 슬라이싱이 안됨.

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object
<class 'pandas.core.series.Series'>
----------------------------------------------------------------------
특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권
<class 'pandas.core.frame.DataFrame'>
----------------------------------------------------------------------
특성     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [101]:
##### 행 인덱싱 (반드시 : 으로 슬라이싱을 해서 써야함)

print(df[:]) # 모든 행 가져오기

print('----------------------------------------------------------------------')

print(df[:1])
print(df[:2])

print('----------------------------------------------------------------------')

print(df[1:3])

print('----------------------------------------------------------------------')
# 행인덱스는 숫자, 문자 가능함
print(df['서울':'부산']) # 이름을 붙였으니까 가능한 것

특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141
----------------------------------------------------------------------
특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
----------------------------------------------------------------------
특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
----------------------------------------------------------------------
특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163

In [112]:
##### 동시에 행과 열에 접근 
# 열이 우선
print(df['2005']['서울']) 
# print(df['2005','서울']) # 한꺼번에 접근은 안됨

print('----------------------------------------------------------------------')

# 2005년도와 2010년도의 서울 인구 조회
#df[['2005','2010']]['서울'] 열따로 행따로 했는데 왜 안될까??? 
# 일종의 규칙임 --> 행은 반드시 : 으로 슬라이싱을 해야함
print(df[['2005','2010']]['서울':'서울'])
print('----------------------------------------------------------------------')
print(df[['2005','2010']][:'서울'])

9762546
----------------------------------------------------------------------
특성     2005     2010
도시
서울  9762546  9631482
----------------------------------------------------------------------
특성     2005     2010
도시
서울  9762546  9631482

#### (4) 열 데이터 갱신, 추가, 삭제

In [113]:
# 갱신(수정)
df['2010-2015 증가율'] = df['2010-2015 증가율']*100

df

특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312           2.83
부산  경상권  3655437  3512547  3393191  3448737           1.63
인천  수도권  2466338  2517680  2632035  2890451           9.82
대구  경상권  2473990  2456016  2431774  2466052           1.41

In [116]:
# 추가
df['2005-2010 증가율'] = ((df['2010'] -df['2005'])/df['2005']* 100).round(2)
df

print('----------------------------------------------------------------------')
df['2000-2005 증가율'] = ((df['2005'] -df['2000'])/df['2000']* 100).round(2)
df

----------------------------------------------------------------------

특성,지역,2000,2005,2010,2015,2010-2015 증가율,2005-2010 증가율,2000-2005 증가율
도시,,,,,,,,
서울,수도권,9853972,9762546,9631482,9904312,2.83,-1.34,-0.93
부산,경상권,3655437,3512547,3393191,3448737,1.63,-3.40,-3.91
인천,수도권,2466338,2517680,2632035,2890451,9.82,4.54,2.08
대구,경상권,2473990,2456016,2431774,2466052,1.41,-0.99,-0.73

In [117]:
# 삭제
del df['2000-2005 증가율']
df

특성   지역     2000     2005     2010     2015  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312           2.83          -1.34
부산  경상권  3655437  3512547  3393191  3448737           1.63          -3.40
인천  수도권  2466338  2517680  2632035  2890451           9.82           4.54
대구  경상권  2473990  2456016  2431774  2466052           1.41          -0.99

#### (5) 실습

In [159]:
data= {
    '국어': [80,90,70,30],
    '영어': [90,70,60,40],
    '수학': [90,60,80,70]
    
}

In [160]:
##### 1. 인덱스를 춘향, 몽룡, 향단, 방자로 구성된 데이터 프레인 df를 작성

idx =['춘향','몽룡','향단','방자']

df = pd.DataFrame(data,index=idx)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [161]:
##### 2. 모든 학생위 수학 점수를 조회
df[['수학']]

    수학
춘향  90
몽룡  60
향단  80
방자  70

In [162]:
##### 3. 모든 학생의 국어와 영어 점수를 조회
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [163]:
##### 4. 모든 학생의 각 과목평균점수를 새로운 열(과목평균)로 추가하시오
df['과목평균'] =((df['수학'] + df['국어'] +df['영어'])/3).round(2)
df

    국어  영어  수학   과목평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [165]:
##### 5. 방자의 영어점수를 80점으로 수정하고 평균점수도 다시 수정하시오
df['영어']['방자'] =80
df

<ipython-input-165-563c5def8815>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] =80

    국어  영어  수학   과목평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [166]:
##### 6. 춘향의 점수를 데이터 프레임 형식으로 출력하시오.
df[:][:'춘향']

    국어  영어  수학   과목평균
춘향  80  90  90  86.67

In [170]:
##### 7. 향단의 점수를 Series로 출력하시오. 
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
과목평균    70.0
Name: 향단, dtype: float64

In [168]:
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
과목평균    70.0
Name: 향단, dtype: float64

#### (6) 파일 입출력

+ read_csv()
+ to_csv()
+ read_table()

In [41]:
## 매직명령어(magic commands)
# 파이썬의 정식 명령어라기 보다는 cmd에서 사용할만한 명령어들을 사용자들의 편의를 위해 
#파이썬 안으로 들여왔음. 변경해야하는 번거로움을 피하기 위해
%%writefile data/sample1.csv
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

UsageError: Line magic function `%%writefile` not found.

In [42]:
sample1=pd.read_csv('data/sample1.csv')
sample1

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [43]:
# 칼럼을 빼고 저장
%%writefile data/sample2.csv 
1,1.11,one
2,2.22,two
3,3.33,three

UsageError: Line magic function `%%writefile` not found.

In [44]:
# 제목이 없는 데이터는 제목을 붙여서 가져올 수 있음 
sample2=pd.read_csv('data/sample2.csv',names=['c1','c2','c3'])
sample2

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [40]:
# 특정한 열을 인덱스로 지정 
sample3=pd.read_csv('data/sample1.csv',index_col='c1')
sample3

      c2     c3
c1
1   1.11    one
2   2.22    two
3   3.33  three

In [206]:
%%writefile data/sample3.txt
c1      c2      c3       c4
0.23    0.33    0.354    0.2389
0.123   0.345   0.567    0.986

Overwriting data/sample3.txt

In [212]:
sample3 = pd.read_table('data/sample3.txt',sep=' ')
sample3 # 공백이 어떤개는 한개 , 두개 이렇게 다 다르기에 공백 하나만 쓰면 안됨
# 정규표현식을 써야함. \s

,c1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,c2,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,c3,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,c4
0,0.230,NaN,NaN,NaN,0.33,NaN,NaN,NaN,0.354,NaN,NaN,NaN,0.2389,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0.123,NaN,NaN,0.345,NaN,NaN,0.567,NaN,NaN,NaN,0.986,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [213]:
sample3 = pd.read_table('data/sample3.txt',sep='\s+')
sample3
#\s = 공백한개 , +를 붙여 주면 한개 이상을 뜻함.

      c1     c2     c3      c4
0  0.230  0.330  0.354  0.2389
1  0.123  0.345  0.567  0.9860

In [10]:
%%writefile data/sample4.txt
파일제목: sample4.txt
데이터포맷의 설명: 어쩌구 저쩌구
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample4.txt

In [45]:
# 설명 빼고 가져오고 싶을 때
#skiprows --> 행 건너뛰기
sample4=pd.read_table('data/sample4.txt',skiprows=[0,1],sep=',')
sample4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [46]:
sample4=pd.read_table('data/sample4.txt',skiprows=2,sep=',') # 2개 행 건너 뛰어라
sample4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [65]:
#결측치는 표시되게끔 불러오겠다
%%writefile data/sample5.csv
c1,c2,c3
1,1.11,
2, , two
누락,3.33,three

SyntaxError: invalid syntax (<ipython-input-65-3d5b2e8bf72f>, line 5)

In [20]:
import os
os.getcwd()
현재경로 = os.getcwd()
현재경로

'C:\\Users\\Administrator\\Downloads\\seonmin\\pythonwork\\analysis'

In [48]:
sample5=pd.read_csv('data/sample5.csv', na_values=[' ','누락'])
sample5

    c1    c2      c3
0  1.0  1.11     NaN
1  2.0   NaN     two
2  NaN  3.33   three

In [54]:
##### 저장 

df.to_csv('data/sample6.csv')

df.to_csv('data/sample7.txt',sep='|')

#인덱스와, 칼럼 지정하고 싶지 않을 때
df.to_csv('data/sample8.csv',index=False,header=False)

#결측치가 있는 데이터 저장 
sample5.to_csv('data/sample9.csv',sep=':')
#--> 이렇게 저장하면 결측치 확인이 안됨 --> 이걸 표시하기 위해 
sample5.to_csv('data/sample9.csv',sep=':',na_rep='누락')

In [35]:
df

특성   지역     2000     2005     2010     2015  2010-2015 증가율
도시
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141